# ws2CommitChanges

## Description
Workspace advanced APIs. Offers restart or reload of the workspace to commit the changes made by this APIs.

```pascal
PROCEDURE ws2CommitChanges(
				restart : BOOLEAN;
				reload  : BOOLEAN);
```

```python

def vs.ws2CommitChanges(restart, reload):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|restart|BOOLEAN||
|reload|BOOLEAN||

## Version
Availability: from Vectorworks 2021
## Category
* Workspaces